import ParallaxScrollView from '@/components/ParallaxScrollView';
import { ThemedText } from '@/components/ThemedText';
import { ThemedView } from '@/components/ThemedView';
import { StyleSheet } from 'react-native';

export default function SutraScreen() {
  return (
    <ParallaxScrollView>
      <ThemedView style={styles.stepContainer}>
        <ThemedText type='default'>
          ເພາະເຫດໃດຈຶ່ງຊື່ວ່າ ອຸປາສົກ? ສະໄໝໜຶ່ງ
          ພຣະຜູ້ມີພຣະພາກປະທັບຢູ່ໃນນິໂຄທາຣາມ ໃກ້ພຣະນະຄອນກະບິນລະພັດ ແຄວ້ນສັກກະ
          ຄັ້ງນັ້ນ
          ພຣະເຈົ້າມະຫານາມະສັກກາຍະຣາດສະເດັດເຂົ້າໄປເຝົ້າພຣະຜູ້ມີພຣະພາກເຖິງທີ່ປະທັບ
          ຊົງອະພິວາດແລ້ວ ປະທັບນັ່ງໃນທີ່ຄວນສ່ວນຂ້າງໜຶ່ງ ດ້ວຍເຫດພຽງເທົ່າໃດ
          ບຸກຄົນຈິ່ງຊື່ວ່າ ອຸປາສົກ? ມະຫານາມະ!
          ບຸກຄົນຜູ້ເຖິງພຣະພຸດທະເຈົ້າເປັນສະຣະນະ ເຖິງພຣະທັມເປັນສະຣະນະ
          ເຖິງພຣະສົງເປັນສະຣະນະ. ມະຫານາມະ ດ້ວຍເຫດພຽງເທົ່ານີ້ແລ ບຸກຄົນຈິ່ງຊື່ວ່າ
          ອຸປາສົກ. ຂ້າແຕ່ພຣະອົງຜູ້ຈະເຣີນ! ດ້ວຍເຫດພຽງເທົ່າໃດ ອຸປາສົກຈິ່ງຊື່ວ່າ
          ເປັນຜູ້ເຖິງພ້ອມດ້ວຍສີນ? ມະຫານາມະ! ອຸປາສົກເປັນຜູ້ງົດເວັ້ນຈາກປານາຕິບາດ,
          ເປັນຜູ້ງົດເວັ້ນຈາກອະທິນນາທານ, ເປັນຜູ້ງົດເວັ້ນຈາກກາເມສຸມິດສາຈານ,
          ເປັນຜູ້ງົດເວັ້ນຈາກມຸສາວາດ,
          ເປັນຜູ້ງົດເວັ້ນຈາກສຸຣາເມຣະຍະມັດຊະປະມາທັດຖານະ. ມະຫານາມະ
          ດ້ວຍເຫດພຽງເທົ່ານີ້ແລ ອຸປາສົກຈິ່ງຊື່ວ່າ ເປັນຜູ້ເຖິງພ້ອມດ້ວຍສີນ.
          ຂ້າແຕ່ພຣະອົງຜູ້ຈະເຣີນ! ດ້ວຍເຫດພຽງເທົ່າໃດ ອຸປາສົກຈິ່ງຊື່ວ່າ
          ເປັນຜູ້ເຖິງພ້ອມດ້ວຍສັດທາ? ມະຫານາມະ! ອຸປາສົກໃນທັມວິໄນນີ້ ເປັນຜູ້ມີສັດທາ
          ເຊື່ອພຣະປັນຍາເຄື່ອງຕຣັດສະຮູ້ຂອງຕະຖາຄົດວ່າ ເພາະເຫດຢ່າງນີ້ໆ
          ພຣະຜູ້ມີພຣະພາກເຈົ້ານັ້ນ ເປັນພຣະອະຣະຫັນຕະ, ຕຣັດຮູ້ເອງໂດຍຊອບ,
          ເຖິງພ້ອມດ້ວຍວິຊາ ແລະ ຈະຣະນະ, ສະເດັດໄປດີແລ້ວ, ຊົງຮູ້ແຈ້ງໂລກ,
          ເປັນສາຣະຖີຝຶກບຸຣຸດທີ່ຄວນຝຶກບໍ່ມີໃຜຍິ່ງກວ່າ, ເປັນສາສະດາຂອງເທວະດາ ແລະ
          ມະນຸດທັງຫລາຍ, ເປັນຜູ້ເບີກບານ, ເປັນຜູ້ຈຳແນກທັມ ດັ່ງນີ້. ມະຫານາມະ
          ດ້ວຍເຫດພຽງເທົ່ານີ້ແລ ອຸປາສົກຈິ່ງຊື່ວ່າ ເປັນຜູ້ເຖິງພ້ອມດ້ວຍສັດທາ.
          ຂ້າແຕ່ພຣະອົງຜູ້ຈະເຣີນ! ດ້ວຍເຫດພຽງເທົ່າໃດ ອຸປາສົກຈິ່ງຊື່ວ່າ
          ເປັນຜູ້ເຖິງພ້ອມດ້ວຍຈາຄະ? ມະຫານາມະ! ອຸປາສົກໃນທຳມະວິໄນນີ້
          ມີໃຈປາສະຈາກມັດສະຣິຍະອັນເປັນມົນທິນ ມີຈາຄະອັນສະລະແລ້ວ ມີຝາມືອັນຊຸ່ມ
          ຍິນດີໃນການສະລະ ເປັນຜູ້ຄວນແກ່ການຂໍ ຍິນດີໃນການແຈກຈ່າຍທານ ຢູ່ຄອງເຮືອນ.
          ມະຫານາມະ ດ້ວຍເຫດພຽງເທົ່ານີ້ແລ ອຸປາສົກຈິ່ງຊື່ວ່າ
          ເປັນຜູ້ເຖິງພ້ອມດ້ວຍຈາຄະ. ຂ້າແຕ່ພຣະອົງຜູ້ຈະເຣີນ! ດ້ວຍເຫດພຽງເທົ່າໃດ
          ອຸປາສົກຈິ່ງຊື່ວ່າ ເປັນຜູ້ເຖິງພ້ອມດ້ວຍປັນຍາ? ມະຫານາມະ!
          ອຸປາສົກໃນທຳມະວິໄນນີ້ ເປັນຜູ້ມີປັນຍາ
          ປະກອບດ້ວຍປັນຍາເຄື່ອງກຳນົດຮູ້ຄວາມເກີດ ແລະຄວາມດັບອັນເປັນອະຣິຍະ
          ເປັນເຄື່ອງຊຳແຣກກິເລດໃຫ້ເຖິງຄວາມສິ້ນທຸກໂດຍຊອບ. ມະຫານາມະ
          ດ້ວຍເຫດພຽງເທົ່ານີ້ແລ ອຸປາສົກຈິ່ງຊື່ວ່າ ເປັນຜູ້ເຖິງພ້ອມດ້ວຍປັນຍາ.
          ---------------------------------------------------- ສັງຍຸຕຕະນິກາຍ
          ມະຫາວາຣະວັຄ 19/392/1590
        </ThemedText>
      </ThemedView>
    </ParallaxScrollView>
  );
}

const styles = StyleSheet.create({
  titleContainer: {
    flexDirection: 'row',
    alignItems: 'center',
    gap: 8,
  },
  stepContainer: {
    gap: 8,
    marginBottom: 8,
  },
});
